src/cf/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПредложениеПоставщика</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ПотребностиПроизводства/ПотребностиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностиПроизводства</name>
  <resources>
    <name>Потребность</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Заказано</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Пришло</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>ИзОстатка</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ЗаказПоставщику/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ВалютаДоИзменения; // валюта и курс, от которых пересчитываются цены при смене валюты
&НаКлиенте
Перем КурсДоИзменения;

#КонецОбласти

#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	ЗаполнитьОстаткиНаСервере();
	УстановитьДоступностьЭлементов();
	НастроитьПотребностиПроизводства();
	КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подменю", Элементы.ТЧТовары.КоманднаяПанель);
	Если Не ТолькоПросмотр Тогда
		КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подбор", Элементы.ТЧТовары.КоманднаяПанель);
	КонецЕсли;
	Если Объект.Ссылка.Пустая() И Не Объект.ВВалюте Тогда
		Объект.Валюта = РаботаСВалютами.ОсновнаяВалюта();
		Объект.КурсВалюты = 1;
		ЗаполнитьВалютуПоДоговору();
	КонецЕсли;
	УстановитьВидимостьВалюты();
	// Копия документа в валюте - курс на её дату, а не исходного документа.
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) И Объект.ВВалюте Тогда
		ЗаполнитьКурсНаДату();
		РаботаСВалютамиКлиентСервер.ПересчитатьСуммыРегл(Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина); 
	ЗапомнитьВалюту();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьОстаткиНаСервере();
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
	УстановитьВидимостьВалюты();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Ложь);
	ВалютаПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИзПредварительных(Команда)
	Если Объект.ТЧТовары.Количество() = 0 Тогда
		ОткрытьФормуПодбораПредварительныхЗаказов();
	Иначе	
		Оп = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОчисткиТабличнойЧасти", ЭтотОбъект);
		ПоказатьВопрос(Оп, Нстр("fr = 'La partie tabulaire sera vidée! continuer?'; ru = 'Табличная часть будет очищена! Продолжить?'; en = 'The tabular part will be cleared! Continue?'; es = '¡La parte de la tabla se limpiará! ¿Continuar?'"), РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет, "Внимание!", КодВозвратаДиалога.Нет); 	
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПотребности(Команда)
	// Товары - дефицит потребности заказа клиента на производство из поля «Заказ клиента» (E7).
	Если Не ЗначениеЗаполнено(Объект.Основание) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Укажите заказ клиента на производство';
				|fr = 'Indiquez la commande client en production';
				|en = 'Specify the customer production order';
				|es = 'Indique el pedido de cliente para producción'"), , "Объект.Основание");
		Возврат;
	КонецЕсли;
	Если Объект.ТЧТовары.Количество() = 0 Тогда
		ЗаполнитьПоПотребностиНаСервере();
		Возврат;
	КонецЕсли;
	Оп = Новый ОписаниеОповещения("ПослеВопросаОЗаполненииПоПотребности", ЭтотОбъект);
	ПоказатьВопрос(Оп, НСтр("fr = 'La partie tabulaire sera vidée! continuer?'; ru = 'Табличная часть будет очищена! Продолжить?';
		|en = 'The tabular part will be cleared! Continue?'; es = '¡La parte de la tabla se limpiará! ¿Continuar?'"),
		РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураКонтрагентаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатурыКонтрагента(Элементы.ТЧТовары.ТекущиеДанные, Объект);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзExcel(Команда)
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыЗагрузки",ЭтаФорма);
	Пар = Новый Структура("СоздаватьТовары",Истина);
	ОткрытьФорму("Обработка.ЗагрузкаИзExcel.Форма.Форма",Пар,ЭтотОбъект,ЭтотОбъект.УникальныйИдентификатор,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОчисткиТабличнойЧасти(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда Возврат КонецЕсли;
	ОткрытьФормуПодбораПредварительныхЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОЗаполненииПоПотребности(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьПоПотребностиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПодбораПредварительныхЗаказов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Объект.ТЧТовары.Очистить();
	Для Каждого Стр Из РезультатЗакрытия Цикл
    	НС = Объект.ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр);
		НС.КоличествоУпаковок = НС.Количество;
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод, Ложь);
		Если СтруктураТОвара = Неопределено Тогда
			Оп = Новый ОписаниеОповещения("ПослеДобавленияНоменклатуры",ЭтаФорма,Новый Структура("Штрихкод",Штрихкод));
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",Новый Структура("Штрихкод",Штрихкод),ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТОвара,,,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыЗагрузки(Результат,ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	ЗаполнитьИзExcelНаСервере(Результат);
	ЗаполнитьОстаткиНаСервере();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура ОткрытьФормуПодбораПредварительныхЗаказов()
	П = Новый Структура("ЗаказПоставщику", Объект.Ссылка);
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыПодбораПредварительныхЗаказов", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ПодборПредварительныхЗаказов", П, ЭтаФорма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры	

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	//ЭтоОсновной = Объект.ВидЗаказа = Перечисления.ВидыЗаказовПоставщику.Основной;
	//Элементы.Контрагент.Видимость = ЭтоОсновной;
	//Элементы.Договор.Видимость = ЭтоОсновной;
	//Элементы.Организация.Видимость = ЭтоОсновной;
	//Элементы.ТЧТоварыЗаказПоставщику.Видимость = ЭтоОсновной;
	//Элементы.ТЧТоварыНоменклатураКонтрагента.Видимость = ЭтоОсновной;
	//Элементы.ТЧТоварыЦена.Видимость = ЭтоОсновной;
	//Элементы.ТЧТоварыСумма.Видимость = ЭтоОсновной;
	//Элементы.ТЧТоварыСуммаСНДС.Видимость = ЭтоОсновной;
	//Элементы.ТЧТоварыСтавкаНДС.Видимость = ЭтоОсновной;
	//Элементы.ТЧТоварыСуммаНДС.Видимость = ЭтоОсновной;
	//Элементы.ТЧТоварыПодобратьИзПредварительных.Видимость = ЭтоОсновной;
КонецПроцедуры	

// Поле «Заказ клиента», кнопка «Заполнить по потребности» и колонка «Продукция» - только при учёте производства.
// Функциональная опция читается на сервере (bsl-009).
&НаСервере
Процедура НастроитьПотребностиПроизводства()
	УчетПроизводства = ПолучитьФункциональнуюОпцию("Производство");
	Элементы.ЗаказКлиента.Видимость = УчетПроизводства;
	Элементы.ТЧТоварыЗаполнитьПоПотребности.Видимость = УчетПроизводства;
	Элементы.ТЧТоварыПродукция.Видимость = УчетПроизводства;
КонецПроцедуры

// Строки - дефицит потребности без движений этого заказа поставщику: перезаполняемые строки заменяют его прежнее
// «Заказано». Заказ без сформированной потребности - сообщение, таблица не меняется.
&НаСервере
Процедура ЗаполнитьПоПотребностиНаСервере()
	Потребности = РегистрыНакопления.ПотребностиПроизводства;
	Заказ = Объект.Основание;
	Если Не Документы.ЗаказПокупателя.ЗаказПроводится(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "ВидОперации"))
		Или Не Потребности.ЗаказФормируетПотребность(Заказ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Потребности.ТекстЗаказБезПотребности(), , "Объект.Основание");
		Возврат;
	КонецЕсли;
	Дефицит = Потребности.ДефицитЗаказа(Заказ, Объект.Ссылка);
	Документы.ЗаказПоставщику.ЗаполнитьПоПотребности(Объект.ТЧТовары, Дефицит, Объект.ЦенаВключаетНДС, Объект.Контрагент);
	Если Дефицит.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Потребности.ТекстПотребностьЗаказана());
	КонецЕсли;
	ЗаполнитьОстаткиНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзExcelНаСервере(Мас)
	Объект.ТЧТовары.Очистить();
	Для Каждого Эл из Мас Цикл
		НС = Объект.ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Эл);
		РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(НС, Объект, Ложь);
		НС.Количество = Эл.Количество;
		НС.КоличествоУпаковок = Эл.КоличествоУпаковок;
		Если ЗначениеЗаполнено(Эл.Цена) Тогда 
			НС.Цена = Эл.Цена;
		КонецЕсли;
		НС.СтавкаНДС = НС.Номенклатура.СтавкаНДС;
		Если ЗначениеЗаполнено(НС.Номенклатура) Тогда 
			НС.Упаковка = НС.Номенклатура.Единица;
		КонецЕсли;
		//Если ЗначениеЗаполнено(Эл.ЦенаМинимальная) Тогда 
		//	НС.ЦенаМинимальная = Эл.ЦенаМинимальная;
		//КонецЕсли;
		//Если ЗначениеЗаполнено(Эл.ЦенаРозничная) Тогда 
		//	НС.ЦенаРозничная = Эл.ЦенаРозничная;
		//КонецЕсли;
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(НС, Объект.ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	МасПоиска = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВНаличииОстатки.Характеристика КАК Характеристика,
	|	ТоварыВНаличииОстатки.Серия КАК Серия,
	|	ТоварыВНаличииОстатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыВНаличии.Остатки(
	|			,
	|			МестоХранения = &МестоХранения
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВТ.Номенклатура,
	|						ВТ.Характеристика
	|					ИЗ
	|						ВТ КАК ВТ)) КАК ТоварыВНаличииОстатки";
	Запрос.УстановитьПараметр("ВТ",Объект.ТЧТовары.Выгрузить());
	Запрос.УстановитьПараметр("МестоХранения",РегистрыСведений.НастройкиПользователей.СкладПользователя());
	ТЗОстатки = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр из Объект.ТЧТовары Цикл 
		МасОстаток = ТЗОстатки.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Стр.Номенклатура,Стр.Характеристика));
		Если МасОстаток.Количество() = 0 Тогда Продолжить; КонецЕсли;
		СтрОстаток = МасОстаток.Получить(0);
		Стр.Остаток = СтрОстаток.Остаток;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбщуюКоманду(Команда)
	КомандыТабличныхЧастейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Количество") Тогда
		РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоПодбору(Объект, ВыбранноеЗначение, , Неопределено, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	КурсПоДатеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ВалютаПоДоговору();
КонецПроцедуры

// Документ в валюте (docs/plans/multicurrency.md): флажок ВВалюте открывает валюту и курс, цены и суммы строк -
// в валюте документа, колонка СуммаРегл - в основной валюте.

&НаКлиенте
Процедура ВВалютеПриИзменении(Элемент)
	ПрежняяВалюта = Объект.Валюта;
	ПрежнийКурс = Объект.КурсВалюты;
	ВВалютеПриИзмененииНаСервере();
	ПослеСменыВалюты(ПрежняяВалюта, ПрежнийКурс);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
	ПослеСменыВалюты(ВалютаДоИзменения, КурсДоИзменения);
КонецПроцедуры

&НаКлиенте
Процедура КурсВалютыПриИзменении(Элемент)
	// Цены остаются в валюте документа - меняются только суммы в основной валюте.
	ПослеСменыВалюты(Объект.Валюта, Объект.КурсВалюты);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПересчитатьСуммуРеглСтроки(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуРеглСтроки(Стр)
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Стр.СуммаРегл = РаботаСВалютамиКлиентСервер.СуммаРегл(Стр.Сумма, РаботаСВалютамиКлиентСервер.КурсДокумента(Объект));
КонецПроцедуры

// Запоминает валюту и курс, от которых пересчитываются цены при следующей смене валюты.
//
&НаКлиенте
Процедура ЗапомнитьВалюту()
	ВалютаДоИзменения = Объект.Валюта;
	КурсДоИзменения = Объект.КурсВалюты;
КонецПроцедуры

// После смены валюты, курса или флажка: суммы в основной валюте и, если сменилась сама валюта, - вопрос
// о пересчёте цен строк из прежней валюты в новую.
//
// Параметры:
//  ПрежняяВалюта - СправочникСсылка.Валюты - валюта до изменения.
//  ПрежнийКурс - Число - курс до изменения.
//
&НаКлиенте
Процедура ПослеСменыВалюты(ПрежняяВалюта, ПрежнийКурс)
	РаботаСВалютамиКлиентСервер.ПересчитатьСуммыРегл(Объект);
	ЕстьСтроки = Объект.ТЧТовары.Количество() > 0;
	Если ПрежняяВалюта = Объект.Валюта Или Не ЕстьСтроки Или ПрежнийКурс <= 0 Тогда
		ЗапомнитьВалюту();
		Возврат;
	КонецЕсли;
	Текст = СтрШаблон(НСтр("ru = 'Пересчитать цены строк из %1 в %2 по курсу?';
		|fr = 'Convertir les prix des lignes de %1 en %2 au taux de change ?';
		|en = 'Convert line prices from %1 to %2 at the exchange rate?';
		|es = '¿Convertir los precios de las líneas de %1 a %2 al tipo de cambio?'"), ПрежняяВалюта, Объект.Валюта);
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПересчетеЦен", ЭтотОбъект, ПрежнийКурс);
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПересчетеЦен(Ответ, ПрежнийКурс) Экспорт
	ЗапомнитьВалюту();
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	// Курсы - к основной валюте (для основной 1), поэтому цена в новой валюте = цена × прежний курс / новый курс.
	Коэффициент = ПрежнийКурс / РаботаСВалютамиКлиентСервер.КурсДокумента(Объект);
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Стр.Цена = Стр.Цена * Коэффициент;
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС, "Цена");
	КонецЦикла;
	РаботаСВалютамиКлиентСервер.ПересчитатьСуммыРегл(Объект);
	Модифицированность = Истина;
КонецПроцедуры

// Договор в валюте переводит документ в эту валюту; при смене валюты - вопрос о пересчёте цен.
//
&НаКлиенте
Процедура ВалютаПоДоговору()
	ЗаполнитьВалютуПоДоговору();
	ПослеСменыВалюты(ВалютаДоИзменения, КурсДоИзменения);
КонецПроцедуры

// Курс на новую дату документа.
//
&НаКлиенте
Процедура КурсПоДатеДокумента()
	Если Не Объект.ВВалюте Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьКурсНаДатуНаСервере();
	ПослеСменыВалюты(Объект.Валюта, Объект.КурсВалюты);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКурсНаДатуНаСервере()
	ЗаполнитьКурсНаДату();
КонецПроцедуры

&НаСервере
Процедура ВВалютеПриИзмененииНаСервере()
	Если Объект.ВВалюте Тогда
		ЗаполнитьКурсНаДату();
	Иначе
		Объект.Валюта = РаботаСВалютами.ОсновнаяВалюта();
		Объект.КурсВалюты = 1;
	КонецЕсли;
	УстановитьВидимостьВалюты();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	ЗаполнитьКурсНаДату();
	УстановитьВидимостьВалюты();
КонецПроцедуры

// Курс валюты документа на его дату из регистра КурсыВалют; курс не задан - нулевой курс и сообщение:
// документ без курса не запишется (РаботаСВалютами.ПроверитьВалютуДокумента), пока курс не введут вручную.
//
&НаСервере
Процедура ЗаполнитьКурсНаДату()
	Если Не Объект.ВВалюте Тогда
		Возврат;
	КонецЕсли;
	Курс = РаботаСВалютами.КурсВалюты(Объект.Валюта, Объект.Дата);
	Объект.КурсВалюты = Курс;
	Если Курс > 0 Тогда
		Возврат;
	КонецЕсли;
	Шаблон = НСтр("ru = 'Курс валюты %1 на %2 не задан (Казначейство - Курсы валют): укажите курс в документе.';
		|fr = 'Le taux de change de %1 au %2 n''est pas défini (Trésorerie - Taux de change) : indiquez le taux dans le document.';
		|en = 'The %1 exchange rate on %2 is not set (Treasury - Exchange rates): enter the rate in the document.';
		|es = 'El tipo de cambio de %1 al %2 no está definido (Tesorería - Tipos de cambio): indique el tipo en el documento.'");
	ТекстСообщения = СтрШаблон(Шаблон, Объект.Валюта, Формат(Объект.Дата, "ДЛФ=D"));
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.КурсВалюты");
КонецПроцедуры

// Договор в валюте, отличной от основной, переводит документ в эту валюту.
//
&НаСервере
Процедура ЗаполнитьВалютуПоДоговору()
	// Документ с заполненными строками (ввод на основании, копирование) валюту не меняет: цены строк
	// остались бы в прежней валюте.
	Если Объект.ТЧТовары.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	ВалютаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВалютаВзаиморасчётов");
	Если Не ЗначениеЗаполнено(ВалютаДоговора) Или ВалютаДоговора = РаботаСВалютами.ОсновнаяВалюта()
		Или ВалютаДоговора = Объект.Валюта Тогда
		Возврат;
	КонецЕсли;
	Объект.ВВалюте = Истина;
	Объект.Валюта = ВалютаДоговора;
	ЗаполнитьКурсНаДату();
	УстановитьВидимостьВалюты();
КонецПроцедуры

// Доступность валюты и курса, заголовки цен и сумм с валютой, колонка сумм в основной валюте.
//
&НаСервере
Процедура УстановитьВидимостьВалюты()
	ВВалюте = Объект.ВВалюте;
	Элементы.Валюта.Доступность = ВВалюте;
	Элементы.КурсВалюты.Доступность = ВВалюте;
	Элементы.ТЧТоварыСуммаРегл.Видимость = ВВалюте;
	ТекстЦена = НСтр("ru = 'Цена'; fr = 'Prix'; en = 'Price'; es = 'Precio'");
	ТекстСумма = НСтр("ru = 'Сумма'; fr = 'Montant'; en = 'Amount'; es = 'Importe'");
	Если ВВалюте Тогда
		ЗаголовокЦена = РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстЦена, Объект.Валюта);
		ЗаголовокСумма = РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстСумма, Объект.Валюта);
	Иначе
		// Пустой заголовок - заголовок по реквизиту.
		ЗаголовокЦена = "";
		ЗаголовокСумма = "";
	КонецЕсли;
	ЗаголовокСуммаРегл = РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстСумма, РаботаСВалютами.ОсновнаяВалюта());
	Элементы.ТЧТоварыЦена.Заголовок = ЗаголовокЦена;
	Элементы.ТЧТоварыСумма.Заголовок = ЗаголовокСумма;
	Элементы.ТЧТоварыСуммаРегл.Заголовок = ЗаголовокСуммаРегл;
КонецПроцедуры

#КонецОбласти
